abandonment
abates
ability
able
abroad
abrogated
absence
accelerating
accept
acceptance
acceptances
accepted
access
accompany
accompanying
accord
according
accords
account
accounted
accounting
accounts
accu
achieved
acquire
acquired
acquires
acquiring
acquisition
acquisitions
acreage
acres
act
action
actions
active
activities
activity
acts
actually
add
added
adding
addition
additional
adjourned
adjusted
adjustment
adjustments
administration
adopted
advance
advanced
advances
advantages
adversely
advised
aegean
aerospace
affairs
affect
affected
affecting
africa
african
afternoon
agencies
agency
aggressively
ago
agree
agreed
agreeing
agreement
agreements
agrees
agricultural
agriculture
ahead
aid
aim
aimed
aiming
air
aircraft
alan
alarm
algeria
allan
alleged
alliance
allied
allies
allocations
allow
allowance
allowed
allows
alternative
aluminium
amb
ambassador
ambassadors
amendment
america
american
americans
amid
amortization
amounted
amounts
analyst
analysts
anatolian
andreas
anger
angered
ankara
announced
announcement
announcing
annoyed
annual
annually
answer
ansy
anticipated
anxious
apart
apparent
apparently
appear
appeared
appears
applied
apply
appointed
appreciation
approach
appropriate
approval
approvals
approve
approved
approximately
april
arab
arabia
arbed
arbitraging
area
areas
argentina
arising
arm
armed
arms
army
arrange
arranged
arrangement
arrangements
arranging
arsenal
article
asia
asian
aside
ask
asked
asking
aspects
assessing
asset
assets
assigned
assist
assistance
assistant
associated
associates
association
assurance
assured
atco
atcor
athens
attempt
attention
attracted
attractive
attributable
attributed
aug
august
australasian
australia
australian
authorised
authorities
authority
authorized
available
average
averaged
averaging
avg
avoid
awarded
aware
away
backed
bad
badly
bags
bahrain
balance
balanced
balances
baldrige
bales
ball
balladur
bancorp
bancshares
band
bank
banker
bankers
banking
banks
barley
baron
barrel
barrels
barriers
bartering
base
based
bases
basf
basic
basis
basket
battery
bay
bean
bearish
beef
began
begin
beginning
begins
belgian
belief
believe
believed
believes
bell
belt
benefit
benefits
best
better
bhp
bid
bidding
bids
big
bigger
bilateral
billion
bills
bilzerian
bit
bitter
black
blamed
bloc
block
bloedel
board
boards
body
bond
bonn
bonus
book
booked
books
boom
boost
boosting
border
borne
borrowing
borrowings
botswana
bought
boycotts
bpd
bra
branches
brand
brands
brazil
brazilian
break
breaking
brief
bring
bringing
brings
britain
british
broad
broadcasting
broadly
broken
brokers
brothers
brought
brown
bruce
bsv
btr
bubble
budget
buffer
build
building
built
bulk
bull
bulletin
bullish
bundesbank
burden
bureau
burned
burst
business
businesses
businessmen
butter
buy
buyer
buyers
buying
buyout
buys
cabinet
cable
cake
caldwell
calendar
california
called
calls
cambist
came
campbell
canada
canadian
canamax
cancelled
candidate
capacity
capital
car
care
careful
carefully
cargill
cargo
cargoes
carl
carried
carrier
carry
cars
cartel
case
cash
cause
caused
causes
causing
cautious
cement
central
centre
centred
centres
cents
cereals
certain
certainly
certificate
certificates
chain
chairman
chamber
chance
change
changed
changes
chapter
charge
charged
charges
charles
chartered
cheap
cheaper
cheated
chemical
chemicals
chicago
chief
chimie
china
chinese
chip
chips
cie
circulation
circumstances
city
claiming
claims
clash
class
clause
clear
clearing
clearly
clients
climate
climbed
close
closed
closely
closer
closing
clothing
coal
coast
cocoa
cocoas
coconut
coffee
cold
colleagues
colombia
colombo
combat
combination
combined
come
comes
comfort
comfortable
coming
comment
comments
commerce
commercial
commission
commitment
commitments
committed
committee
commodities
commodity
common
commonwealth
communications
community
compagnie
companies
company
compared
compares
compensate
compensation
competition
competitive
complete
completed
completes
completing
completion
complex
component
components
comprise
comprising
compromise
computer
computers
concentrate
concentrating
concern
concerns
concerted
conciliatory
concrete
condition
conditional
conditionally
conditions
conducting
conducts
conference
confidence
confident
confirm
confirmed
confirms
conform
confrontation
confused
conglomerate
congress
connection
consecutive
conservative
conserve
consider
considerable
considerably
consideration
considered
considering
considers
consolidated
consortium
construction
constructive
consultations
consulting
consumer
consumers
consumption
contained
containing
contents
continental
contingent
continue
continued
continues
continuing
contract
contracts
contradictory
contribution
contributor
control
controlling
controls
convertible
convince
coodination
cooperate
cooperation
cooperative
coordinate
core
corn
corp
corporate
corporation
corporations
corrected
correcting
corrects
cost
costa
costs
cotton
council
countertrade
countertrading
counties
countries
country
counts
county
coupon
course
court
cover
covered
covering
cpc
cpi
create
created
credit
creditors
credits
crisis
crk
crop
crops
cross
crowley
crowns
crucial
crude
cts
cubic
cumulative
curb
curbs
currencies
currency
current
currently
customer
customers
customs
cut
cuts
cutting
cyclops
cyprus
daily
dairy
damage
damages
danforth
dangerously
dangers
daniel
data
date
david
day
days
deadline
deal
dealer
dealers
deals
dean
debentures
debt
debts
dec
december
decide
decided
decides
decision
declared
decline
declined
declines
declining
decrease
deep
defence
defend
defense
deferred
deficit
deficits
defined
definitely
defuse
degree
degrees
delay
delayed
delegate
delegates
delegations
delivered
delivery
demand
democracies
denied
denis
denshin
denwa
department
depend
dependence
depending
deposit
deposits
depreciation
depress
depressed
depth
deputy
des
described
design
designed
despite
destinations
detailed
details
determine
determined
deutsche
develop
developed
developing
development
developments
differ
difference
different
differential
differentials
difficult
difficulties
difficulty
diluted
dinar
dip
diplomatic
diplomats
direct
director
directors
disagreement
disastrous
disclose
disclosed
discontinue
discontinued
discount
discounts
discreetly
discuss
discussed
discussion
discussions
disease
disposal
disposals
dispose
dispute
disputed
disputes
disrupt
distribute
distribution
div
diversification
diversified
dividend
dividends
division
dixons
dlr
dlrs
document
dollar
dollars
domestic
dominant
dominated
dominican
double
doubt
doubtful
douglas
downward
drain
draw
drawing
drew
drill
drilling
driven
drop
dropped
drought
dry
dumping
dutch
duties
dynamism
earlier
early
earned
earnings
ease
eased
easing
east
eastern
economic
economies
economist
economists
economy
ecuador
editorial
edouard
educate
education
effect
effective
effects
effort
efforts
eishiro
elaborate
elders
elect
elected
elections
electric
electrical
electricity
electronic
electronics
emerge
emerged
emergency
emerging
emirates
emphasis
employees
employs
ems
enable
enabled
encourage
encouraging
end
ended
ending
endorsing
ends
energy
engineering
england
enjoy
enlarged
ensure
enter
entered
entering
enterprise
enterprises
entertainment
entire
environment
envisaged
equal
equipment
equity
equivalent
erbynn
ergenc
ericsson
errors
erupted
escorted
especially
est
establish
established
establishing
estate
estimate
estimated
estimates
eugene
europe
european
europeans
evaluate
eventually
evidence
exactly
example
exceed
exceeded
exception
exceptional
excess
excessive
exchange
exchanges
exchequer
excise
exclude
excluded
excludes
excluding
executive
executives
exercise
existing
expand
expanded
expanding
expansion
expect
expectation
expectations
expected
expects
expenditure
expenses
expensive
experience
experts
expire
explained
explaining
exploration
explosive
export
exported
exporter
exporters
exporting
exports
expressed
expressing
extend
extended
extends
extension
external
extraordinary
extremely
face
faced
faces
facilities
facing
fact
factors
failed
failure
fair
fairly
fall
fallen
falling
falls
family
far
farm
farmers
fast
faster
fats
fault
favour
favourable
favoured
fear
feasibility
feature
feb
february
fed
federal
federated
federation
feed
feel
feeling
feels
feet
fell
felt
ferruzzi
field
fields
figure
figures
filed
fin
final
finalized
finally
finance
financial
financing
finding
fine
firm
firmed
firms
fiscal
fish
fit
fixed
fixing
flank
flat
fleming
flexibility
flexible
floor
flow
flows
fluctuations
fob
focus
focusing
follow
followed
following
follows
food
foods
force
forced
forces
forcing
forecast
forecaster
forecasts
foreign
foreigners
forex
form
formal
formally
formed
forms
forward
fourth
framework
franc
francaise
france
francs
free
freight
french
frequent
frequently
friction
friday
friends
fruits
frustration
fuel
fuels
fuer
fulfill
fully
fund
fundamentals
funds
future
futures
gain
gains
galactic
galcf
game
gap
garcia
gas
gasoline
gatt
gave
gdp
gearing
gemeinwirtschaft
general
generale
generally
generated
george
german
germany
getting
ghana
giant
giordano
given
gives
giving
gld
global
gmt
gnb
gnp
goal
goals
goes
going
gold
goldman
gone
good
goods
gotoda
gould
government
governor
grade
grading
gradual
grain
granted
great
greater
greece
greek
green
grew
grit
gross
ground
grounds
group
groups
grow
growers
growing
grown
growth
gruppo
guarantee
guaranteed
guaranty
guidelines
guilder
guilders
gulf
guven
habits
hague
half
hamburg
han
hand
handle
hands
hanson
happening
happy
hard
harder
haruo
harvest
harvested
head
headed
heads
heard
hearing
heart
heated
heavy
hedge
hedging
heinrich
held
heller
help
helped
heng
henley
heralded
hgca
high
higher
highest
hike
hikes
hikmat
hill
historic
historical
history
hit
hmsb
hold
holders
holding
holdings
holds
holmes
home
hon
honeywell
hong
hope
hoped
hopes
hostile
hotels
hour
hours
house
houses
housing
howard
huge
icco
ico
idea
ideas
identified
identify
ignored
illustrating
imbalance
imbalances
immediate
immediately
impact
impatient
impetus
implement
implementing
implication
implications
import
important
imported
importing
imports
impose
imposed
imposing
impossible
impressed
improve
improved
improvement
improvements
improving
inch
include
included
includes
including
income
incorporated
incorporation
increase
increased
increases
increasing
increasingly
incurred
indebted
independent
index
india
indian
indiana
indicate
indicates
indication
indirect
indonesia
indonesian
industrial
industrialised
industrialized
industries
industry
inflation
influence
influences
information
informed
ing
ingrained
inherent
initial
initially
inquiries
inside
insignificant
install
instead
institute
institution
institutions
instructed
insufficient
insurance
int
intangible
integration
intelligence
intend
intended
intends
intent
intentions
interested
interests
intermediate
internal
international
interval
intervene
intervened
intervenes
intervening
intervention
interview
introduce
introduction
inventories
inventory
investigation
investment
investments
investor
investors
invisible
involve
involved
involving
inward
iron
irrational
island
islands
isolated
issuance
issue
issued
issues
italian
italy
items
ivorian
ivory
ixl
jacques
jamaica
james
jan
january
japan
japanese
jardine
jerome
jiyun
job
john
join
joint
jointly
jordan
jose
judgement
juergen
july
jump
june
jute
kanon
kaohsiung
kawasaki
keeping
keidanren
kenya
kept
ketza
key
kiichi
killed
kilos
kind
know
kobena
kokusai
kong
korea
korean
kouame
kuranari
kuwait
kyodo
labor
labour
lac
lack
lake
land
lanka
large
largely
larger
largest
late
later
latest
latex
latin
launched
law
lawsuits
lazier
lead
leaded
leader
leaders
leadership
leading
lease
leased
leave
leaves
led
left
legal
legislation
lehman
lending
leonard
lesson
let
letter
level
levels
liabilities
libya
license
lies
life
lifestyle
light
like
likely
limit
limited
limits
line
lines
linked
liquid
liquidity
lira
lire
list
listed
listing
little
live
livestock
living
lme
loading
loan
loans
local
locally
located
location
london
long
longer
look
looked
looking
looks
lord
lose
losing
loss
losses
lost
lot
louisiana
low
lower
lowered
lowest
lsb
lynch
machinery
machines
macmillan
maekawa
main
mainly
maintain
maintained
maize
major
majority
make
maker
makers
makes
making
malaysia
malaysian
malcolm
management
manager
managers
managing
manila
manufacture
manufacturer
manufacturers
manufactures
manufacturing
marathon
march
margaret
margin
margins
margoshes
maritime
mark
market
marketing
markets
marks
martin
masaharu
mass
massive
matabeleland
match
material
matheson
matter
maturing
maximum
mclean
meal
mean
means
meant
measure
measured
measures
meat
media
medical
medium
meet
meeting
meetings
member
members
men
mentioned
merchants
merged
merger
merrill
met
metal
metals
mexico
meyer
michael
microchips
midday
middle
midnight
mii
miles
military
milk
milling
mineable
mineral
minerals
mines
minimum
mining
minister
ministerial
ministers
ministry
minnesota
minorities
minority
minstar
misunderstanding
misunderstandings
miti
mitsubishi
miyazawa
mln
mmtc
mobile
moderate
modest
mohammed
moisture
moltke
moment
monday
monetary
money
month
monthly
months
morgan
morning
motion
motor
motors
mounting
movement
movements
moves
moving
mths
mutual
nakasone
named
narrow
narrowed
nashashibi
nation
national
nations
nato
natural
naval
navy
near
nearby
nearly
nec
necessary
need
needed
needs
negative
negotiate
negotiations
neighbouring
neighbours
net
netherlands
new
newly
news
newspaper
newspapers
nicholas
nickel
night
nil
nominal
nonetheless
normal
normally
north
northern
northwest
notably
note
noted
notes
notified
noting
november
nuclear
number
numbers
nursery
objections
obligation
obligations
obtain
obtaining
occidental
occur
october
offer
offered
offering
offers
office
officer
offices
official
officially
officials
offset
offsetting
offshore
oil
oils
oklahoma
old
oman
omissions
opec
open
opened
opening
oper
operate
operates
operating
operation
operations
operators
opinion
opportunities
opposed
opposes
opposition
optimistic
option
optional
options
order
ordered
orders
ordinary
ore
oregon
organic
organisation
organization
organizing
origin
original
origins
ounce
ounces
oustanding
outbreak
outflows
outline
outlining
outlook
output
outright
outside
outstanding
outward
overall
overhaul
overnight
overseas
overvaluation
owned
ownership
owns
oxide
ozal
pace
pacific
package
pact
paid
pak
palm
panama
panel
papandreou
paper
par
parent
paris
parliament
parliamentary
partial
partially
participate
participating
participation
particularly
parties
partly
partner
partners
partnership
parts
party
pass
passage
passed
past
paul
pay
payable
paying
payment
payments
payout
pcr
pct
peak
peg
pegged
peking
pennock
pension
people
percentage
perception
performance
period
periods
permanent
permit
permitted
personal
persuade
peru
peter
petroleum
phab
pharmacia
philadelphia
philip
philippine
philippines
phlx
pillsbury
pioneered
place
placed
placements
plambeck
plan
planes
planned
planning
plans
plant
planted
plants
plastics
platform
plaza
plc
pleased
pledged
plunge
plus
pnp
point
pointed
points
poland
policies
policy
political
politically
poor
popular
popularity
port
portfolio
portland
ports
portugal
pose
position
positions
positive
possibility
possible
possibly
post
posted
potential
potentially
pound
pounds
power
powerful
powers
practically
practice
practices
practises
precambrian
precedent
predicted
predicts
preference
preferred
preliminary
premier
premium
premiums
prepared
prescott
present
presented
president
press
pressure
pressures
pretax
pretty
prevarication
prevent
previous
previously
price
priced
prices
pricing
primarily
prime
principle
prior
private
privately
probable
probably
problem
problems
procedure
procedures
process
processed
processing
produce
produced
producer
producers
produces
producing
product
production
productivity
products
profit
profitable
profits
program
programme
programs
progress
progressive
project
projected
projects
promise
promises
promote
promoted
promoting
prompt
properties
proportion
proposal
proposals
propose
proposed
prospecting
prospects
prospectus
protect
protection
protectionism
protectionist
protest
protesting
proven
provide
provided
provides
providing
province
provision
provisional
provisionally
provisions
psy
pty
public
publications
publicly
published
pull
purchase
purchased
purchasers
purchases
purchasing
push
pushed
pushing
puts
qant
qatar
qtly
qtr
qtrly
qualities
quality
quantech
quarter
quarterly
quarters
question
questions
quick
quickly
quietly
quite
quota
quotas
quoted
radio
rails
railway
rain
rains
raise
raised
raises
raising
rand
range
ranged
ranges
rapid
rapidly
rate
rates
ratio
raw
ray
reach
reached
react
reacted
reacting
readiness
ready
reagan
real
realized
really
reason
reasons
rebound
receive
received
receiving
recent
recently
recession
reciprocal
recognise
recommendation
recommendations
recommended
recommending
record
recorded
recorders
recourse
recovery
red
reduce
reduced
reducing
reduction
reductions
reference
referring
refined
refiners
refinery
reflect
reflected
reflecting
reflects
reform
refused
reg
regarding
regards
region
regional
registered
registration
regret
regular
regularly
regulation
regulations
regulatory
rejected
related
relations
relationship
relative
relatively
release
released
reliance
relocated
remain
remainder
remained
remaining
remains
remarks
removal
remove
reneged
renewal
reorganisation
reorganization
repayment
repeated
replace
replaced
replacing
replied
reply
report
reported
reporters
reporting
reports
representative
represented
represents
republic
repurchase
request
require
required
requirement
requirements
research
reservations
reserve
reserves
residents
resist
resolve
resources
respect
respectively
response
responsible
rest
restated
restaurant
restored
restraint
restricted
restrictions
restrictive
restructure
restructuring
result
resulted
resulting
results
resume
retail
retained
retaliate
retaliation
retaliatory
retire
return
returning
reuter
reuters
rev
revenue
revenues
reverse
review
revised
revises
revs
right
rights
rigs
rise
risen
rises
rising
risk
risks
rival
river
robert
robin
rodney
roger
role
romania
romero
ron
ronald
room
rosario
rose
rothschild
roughly
round
rounding
routine
row
royal
rubber
rules
ruling
rumors
rumours
run
running
runs
rupees
rupiah
saba
sachs
said
sail
sailing
saito
sale
sales
san
sanctions
sanford
satisfactory
satisfied
satisfy
satoshi
saudi
savings
saw
say
saying
says
scale
schedule
scheduled
scheme
sciences
scott
sea
searching
season
seasonal
seasonally
sec
second
secretary
sector
sectors
secured
securities
security
seek
seeking
seen
sees
selected
sell
selling
sells
semiconductor
semiconductors
senate
send
senior
sense
sensitive
sensitively
sent
separate
sept
september
series
serve
serves
service
services
servicing
session
sessions
set
sets
settle
settlement
seven
share
shareholder
shareholders
shares
sharp
sharply
shearson
shed
sheet
shelf
shell
shield
shift
ship
shipment
shipments
shipping
ships
shoichi
short
shortage
shortfall
shortly
showed
showers
showing
shows
shr
shrinking
shrs
shut
sides
signature
signed
significant
significantly
signs
silver
similar
similarly
simon
simultaneously
singapore
single
sismik
situation
size
slash
slide
sliding
slightly
slipped
slow
slower
sluggish
small
smaller
smith
snow
soared
societe
soft
sold
solution
solve
soon
sought
sounded
sounds
source
sources
south
southern
southwestern
soviet
soybean
soybeans
spain
sparanlagen
speaking
special
specialty
specific
specify
speculated
speculation
speculative
speech
speedy
spend
spending
spent
sperry
spirit
split
splits
spoke
spokesman
spokeswoman
sporadic
spot
spotted
spreading
spring
sra
srd
sri
stabilise
stability
stabilize
stabilizing
stable
staff
stage
stagnant
stake
stance
stand
standard
stands
starch
start
started
starting
state
stated
statement
statements
states
statistical
statistics
status
staunch
stay
stc
steady
steel
steelmakers
steep
stem
stems
step
stepping
steps
sterling
stern
stg
sticking
stock
stockholders
stocks
stood
stop
stopped
store
stores
strategic
strategy
strength
strengthened
strengthening
strict
strike
strong
struck
structural
structures
study
studying
subcommittee
subject
submitted
subordinated
subsequently
subsidiaries
subsidiary
substantial
substantially
succeed
success
successful
sued
suffer
suffered
sugar
suggest
suggested
suit
sum
sumita
sumitomo
summer
summit
superdrug
supermarket
supplier
suppliers
supplies
supply
support
supported
sure
surplus
surpluses
surprised
survey
suspend
suspended
suspension
sustained
swap
swaps
sweden
swiss
switch
switched
switching
swung
sydney
systems
tackle
tadashi
taiwan
taken
takeover
takes
taking
talk
talking
talks
tally
target
targets
targetted
tariff
tariffs
tax
taxes
tea
technical
technology
teeth
tek
tektronix
telecommunications
telephone
television
tell
telling
temperatures
temporarily
temporary
tendency
tender
tenders
tension
tensions
term
terms
territory
test
texas
textiles
thai
thailand
thassos
thatcher
theoretically
thing
things
think
thinking
thinks
thoroughly
thought
thousand
threat
threatened
thursday
tian
tight
time
times
tin
tire
tobacco
today
tok
tokheim
tokyo
told
tomorrow
ton
tonight
tonnage
tonne
tonnes
tons
took
topped
toshiba
total
totaled
totalled
totalling
totally
tour
town
trade
traded
trader
traders
trading
traditional
transaction
transactions
transfer
transferred
transformation
transforming
transpacific
transport
transportation
travelled
treasurer
treasuries
treasury
treatment
trees
trend
tried
trip
troops
truer
trust
try
trying
tuesday
turben
turgut
turkey
turkish
turn
turnover
twice
uhco
unable
unacceptable
unadjusted
uncertain
uncertainty
unchanged
und
underlined
underlying
undertaken
undertaking
underway
underwritten
undisclosed
uneconomic
unemployment
unfair
union
unions
unit
united
units
universal
university
unless
unlikely
unsatisfactory
unsolved
unspecified
unstable
upcoming
upland
ups
upward
upwards
urban
urge
urged
urges
urging
uruguay
usda
use
used
users
using
ussr
usx
utility
vain
valley
value
valued
values
variety
various
vast
vegetable
venezuela
venice
venture
vermoegensbildung
versus
vessel
vessels
viacom
vice
video
view
views
violating
virtually
visible
visit
visited
visiting
volatile
volume
volumes
von
vote
voted
votes
voting
wage
wait
waiting
waivers
wales
walter
want
wanted
wants
war
warburg
warehouses
warned
warning
warrant
warrants
warships
washington
waste
watch
watching
water
waters
way
ways
weak
weakening
weakness
weather
wednesday
week
weekend
weekly
weeks
weighed
welcomed
welcomes
went
west
western
westinghouse
wet
wheat
white
wholesale
wholly
wide
widened
widening
wider
widespread
william
willing
wind
window
winter
wireless
withdraw
witter
woodward
woolworth
word
words
work
worked
workers
working
works
world
worldwide
worried
worsen
worth
writedown
writing
yasuhiro
year
yearend
yearly
years
yellow
yen
yesterday
yield
yielding
york
yugoslavia
yukon
yulo
zealand
zero
zimbabwe
zimbabwean
zinc
zone
